In [1]:
import mysql.connector

# Connection details
config = {
    'host': 'localhost',
    'port':3306,      
    'user': 'root',  
    'password': 'rd269TWIN#',  
    'database': 'bct2077'   
}

# Establish connection
try:
    connection = mysql.connector.connect(**config)
    if connection.is_connected():
        print("Successfully connected to MySQL!")
        
except mysql.connector.Error as e:
    print(f"Error connecting to MySQL: {e}")

Successfully connected to MySQL!

In [2]:
connection.close()

In [3]:
connection

In [5]:
create_table_query = """
        CREATE TABLE students (
            id INT AUTO_INCREMENT PRIMARY KEY,
            name VARCHAR(255) NOT NULL,
            age INT NOT NULL,
            gender ENUM('Male', 'Female', 'Other') NOT NULL,
            created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
        );
    """

cursor = connection.cursor()
cursor.execute(create_table_query)

In [7]:
insert_query = """
        INSERT INTO students (name, age, gender)
        VALUES
            ('John Doe', 20, 'Male'),
            ('Jane Smith', 22, 'Female'),
            ('Alex Johnson', 19, 'Other'),
            ('Emily Davis', 21, 'Female');
"""
cursor.execute(insert_query)
connection.commit()

In [3]:
import pandas as pd

In [5]:
select_query = """
    SELECT * FROM teacher
"""
df = pd.read_sql(select_query,connection)
df.head()

C:\Users\Anup Acharya\AppData\Local\Temp\ipykernel_9648\2639805262.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(select_query,connection)

   t_id  t_name       t_address  t_phone_no t_faculty
0     1  Ramesh       Lainchaur  9876543210  Computer
1     2  Ganesh  Budhanilkantha  9876543211  Computer
2     4  Haresh        Kalimati  9876543213  Computer

In [6]:
df.to_csv("select_result.csv",index=False)

In [7]:
select_query = """
    SELECT * FROM teachers
"""
df = pd.read_sql(select_query,connection)
df.head()

C:\Users\achar\AppData\Local\Temp\ipykernel_16524\2883035464.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(select_query,connection)

,TABLE_CATALOG,TABLE_SCHEMA,TABLE_NAME,TABLE_TYPE,ENGINE,VERSION,ROW_FORMAT,TABLE_ROWS,AVG_ROW_LENGTH,DATA_LENGTH,...,INDEX_LENGTH,DATA_FREE,AUTO_INCREMENT,CREATE_TIME,UPDATE_TIME,CHECK_TIME,TABLE_COLLATION,CHECKSUM,CREATE_OPTIONS,TABLE_COMMENT
0,def,mysql,columns_priv,BASE TABLE,InnoDB,10.0,Dynamic,0.0,0.0,16384.0,...,0.0,4194304.0,NaN,2024-12-15 18:52:04,None,None,utf8mb3_bin,None,row_format=DYNAMIC stats_persistent=0,Column privileges
1,def,mysql,component,BASE TABLE,InnoDB,10.0,Dynamic,0.0,0.0,16384.0,...,0.0,4194304.0,1.0,2024-12-15 18:52:04,None,None,utf8mb3_general_ci,None,row_format=DYNAMIC,Components
2,def,mysql,db,BASE TABLE,InnoDB,10.0,Dynamic,2.0,8192.0,16384.0,...,16384.0,4194304.0,NaN,2024-12-15 18:52:04,None,None,utf8mb3_bin,None,row_format=DYNAMIC stats_persistent=0,Database privileges
3,def,mysql,default_roles,BASE TABLE,InnoDB,10.0,Dynamic,0.0,0.0,16384.0,...,0.0,4194304.0,NaN,2024-12-15 18:52:04,None,None,utf8mb3_bin,None,row_format=DYNAMIC stats_persistent=0,Default roles
4,def,mysql,engine_cost,BASE TABLE,InnoDB,10.0,Dynamic,2.0,8192.0,16384.0,...,0.0,4194304.0,NaN,2024-12-15 18:52:04,None,None,utf8mb3_general_ci,None,row_format=DYNAMIC stats_persistent=0,

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 356 entries, 0 to 355
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TABLE_CATALOG    356 non-null    object
 1   TABLE_SCHEMA     356 non-null    object
 2   TABLE_NAME       356 non-null    object
 3   TABLE_TYPE       356 non-null    object
 4   ENGINE           170 non-null    object
 5   VERSION          249 non-null    float64
 6   ROW_FORMAT       170 non-null    object
 7   TABLE_ROWS       249 non-null    float64
 8   AVG_ROW_LENGTH   249 non-null    float64
 9   DATA_LENGTH      249 non-null    float64
 10  MAX_DATA_LENGTH  249 non-null    float64
 11  INDEX_LENGTH     249 non-null    float64
 12  DATA_FREE        249 non-null    float64
 13  AUTO_INCREMENT   17 non-null     float64
 14  CREATE_TIME      356 non-null    datetime64[ns]
 15  UPDATE_TIME      0 non-null      object
 16  CHECK_TIME       0 non-null      object
 17  TABLE_COLLATION  170 non-null    object
 18  CHECKSUM         0 non-null      object
 19  CREATE_OPTIONS   249 non-null    object
 20  TABLE_COMMENT    356 non-null    object
dtypes: datetime64[ns](1), float64(8), object(12)
memory usage: 58.5+ KB